# Напишите программу, которая будет 
# преобразовывать десятичное число в двоичное.

number = int(input('Введите целое число: '))
# new_number = bin (number)
print(f' Число {number}  в двоичной системе = {bin (number)[2:]}')

